//Лабораторна робота №7 "Проектування ітераційних алгоритмів"
//Грищук Анжеліка, Група Тр-22, варіант №8.
#include<stdio.h>
#include<stdlib.h>
#include<math.h>
int main() {
	double x, //аргумент функції
		eps, //похибка
		an,  //n-ий член суми
		s,   //сума
		f;   //значення функції
	int k,   //гранична кількість ітерації
		n,   //кількість виконаних ітерацій
		ind; //індикатор
	char vidp;
	system("chcp 1251 & cls");
	printf("Функція f = (e^x - 1)\n");
	printf("Ряд E(n=0... +00)(x^n+1)/(n+1)!) при х є [-10, 10]\n");
	//Введеня вхідних даних 
	do {
		//введення х
		ind = 1;
		do {
			printf(" введіть x: ");
			scanf_s("%lf", &x);
			fseek(stdin, 0, SEEK_END); // очистка буфера
			if (x < -10 || x > 10) printf("\t невірне значення x(Поза проміжком)\n");
			else ind = 0;
		} while (ind);
		//Ввід епселон
		ind = 1;
		do {
			printf("Введіть eps: ");
			scanf_s("%lf", &eps);
			fseek(stdin, 0, SEEK_END); // очистка буфера
			if (eps <= 0) printf("\t невірне значення eps (не може бути <=0)\n");
			else ind = 0;
		} while (ind);
		//Значення k
		ind = 1;
		do {
			printf("Введіть k: ");
			scanf_s("%d", &k);
			fseek(stdin, 0, SEEK_END); // очистка буфера
			if (k <= 0) printf("\t невірне значення k (не може бути <=0)\n");
			else ind = 0;
		} while (ind);
		//Обчислення значення степеневого ряду
		n = 0;
		an = x; //перший член ряду
		s = an;
		do {
			n++;
			an *= x / (n + 1); // застосування прийому мемоїзації
			s += an;
		} while (fabs(an) >= eps && n < k);
		//Виведення результатів
		if (n == k)
			printf("Досягнуто ліміту кількості ітерацій\n");
		printf("Результат: \n");
		printf("Кількість ітерацій n = %d\n", n);
		printf("Наближене значення функції s=%0.9f\n", s);
		//Обчислення значення функції
		f = exp(x) - 1;
		printf("Точне заечення функції f = %0.9f\n", f);
		printf("Похибка |f-s| = %0.9f\n", fabs(f - s));
		fseek(stdin, 0, SEEK_END); // очистка буфера
		printf(" Продовжити роботу ( Y - Так)?");
		while ((vidp = getchar()) == ' ' || vidp == '\n' || vidp == '\t');// пропуск пробільних символів
		//і одержання відповіді
		fseek(stdin, 0, SEEK_END);// для очищення буферу від зайвої інформації
	} while (vidp == 'Y' || vidp == 'y' || vidp == 'T' || vidp == 'т');// з українськими буквами Т чи т
	printf("\n\n");
	system("pause & cls");
	return 0;
}

