//Лабораторна робота №5. Послідовна перевірка умов 
#include <stdio.h> 
#include <math.h>
#include <stdlib.h>
int main()
{
	float x,
		y,
		a, b;
	int ind;
	system("chcp 1251 & cls");
	/* Виведення вигляду функції на екран */
	printf("    = sin(x)       при x [-1,6)\n");
	printf("f = 3x^2+bx        при x=6\n");
	printf("    = ln(ax-3b)    при x (6,8)\n");
	/* Введення вхідних даних */
	printf("\nВведіть значення a ");
	scanf_s("%f", &a);
	printf("Введіть значення b ");
	scanf_s("%f", &b);
	printf("Введіть значення x ");
	scanf_s("%f", &x);
	ind = 0;
	/* Обчислення значення функції */
	/* Значення х задано поза проміжком */
	if ((x <= -1) || (x >= 8))
	{
		printf("Функція не визначена");
	}
	/* Перший проміжок. ОДЗ не порушено */
	if (x >= -1 && x < 6)
	{
		y = sin(x);
		ind = 1;
	}
	/* Другий проміжок. Особливостей нема */
	if (x == 6)
	{
		y = x * (3 * x + b);
		ind = 1;
	}
	// Третій проміжок. Одз порушено
	if ((x > 6) && (x < 8) && (a * x - 3 * b <= 0))
	{
		printf("Підлогарифмічний вираз менший або дорівнює нулю");
	}
	// Третій проміжок. Одз не порушено
	if ((x > 6) && (x < 8) && (a * x - 3 * b > 0))
	{
		y = log(a * x - 3 * b);
		ind = 1;
	}
	/* Значення х задано поза проміжком */
	if (ind)
		printf("f(%4.2f)=%6.3lf", x, y);
	/* Затримка вікна виведення */
	printf("\n\n");
	system("pause & cls");
	return 0;
}
